# Force Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MemberForces..::..Force Property
MemberForces Class See Also
---
The translational forces at relative point position of the element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public XYZ Force { get; set; }
```

Visual Basic
---
```text
Public Property Force As XYZ
	Get
	Set
```

Visual C++
---
```text
public:
property XYZ^ Force {
	XYZ^ get ();
	void set (XYZ^ value);
}
```

# Remarks
The x value of XYZ object represents moment about x-axis of the analytical element coordinate system, y about y-axis, z about z-axis respectively.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
MemberForces Class
Autodesk.Revit.DB.Structure Namespace